app/controllers/movies_controller.rb

	  end

	  # Get the sorted list of movies or the filtered list of movies
	  @movies = Movie.where(rating: (@filtered_ratings.is_a?(Hash) ? @filtered_ratings.keys : @filtered_ratings)).order(@sort)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date